{
    "common": {
        "name": "ham",
        "version": "4.0.1",
        "news": {
            "4.0.1": {
                "en": "update homebridge and wrapper to 1.3.4 (latest as of today). IMPORTANT: Requires also homebridge 1.3.x installed when using global mode and local mode will update to 1.3.x too! Check your plugins for updates!\nAdd an experimental version of new plugin selection and configuration tab - TRY IT OUT!\nIMPORTANT: Configurations in local/global mode with child bridges will NOT work because ioBroker can not access the data on the child bridge processes!",
                "de": "Aktualisieren Sie Homebridge und Wrapper auf 1.3.4 (Stand heute). WICHTIG: Erfordert auch die Installation von homebridge 1.3.x, wenn der globale Modus verwendet wird, und der lokale Modus wird ebenfalls auf 1.3.x aktualisiert! Überprüfen Sie Ihre Plugins auf Updates!\nFügen Sie eine experimentelle Version der neuen Registerkarte zur Auswahl und Konfiguration von Plugins hinzu - TRY IT OUT!\nWICHTIG: Konfigurationen im lokalen / globalen Modus mit untergeordneten Bridges funktionieren NICHT, da ioBroker nicht auf die Daten der untergeordneten Bridge-Prozesse zugreifen kann!",
                "ru": "обновите homebridge и wrapper до версии 1.3.4 (последней на сегодняшний день). ВАЖНО: при использовании глобального режима требуется также установка homebridge 1.3.x, а также в локальном режиме будет установлено обновление до 1.3.x! Проверяйте свои плагины на наличие обновлений!\nДобавьте экспериментальную версию новой вкладки выбора и конфигурации плагина - ПОПРОБУЙТЕ!\nВАЖНО: конфигурации в локальном / глобальном режиме с дочерними мостами НЕ будут работать, потому что ioBroker не может получить доступ к данным в дочерних процессах моста!",
                "pt": "atualize o homebridge e o wrapper para 1.3.4 (o mais recente a partir de hoje). IMPORTANTE: Requer também o homebridge 1.3.x instalado ao usar o modo global e o modo local também será atualizado para 1.3.x! Verifique se há atualizações nos seus plug-ins!\nAdicione uma versão experimental da nova guia de seleção e configuração de plug-in - EXPERIMENTE!\nIMPORTANTE: As configurações no modo local / global com pontes filhas NÃO funcionarão porque o ioBroker não pode acessar os dados nos processos de pontes filhas!",
                "nl": "update homebridge en wrapper naar 1.3.4 (laatste vanaf vandaag). BELANGRIJK: vereist ook dat homebridge 1.3.x is geïnstalleerd bij gebruik van de globale modus en de lokale modus zal ook worden bijgewerkt naar 1.3.x! Controleer uw plug-ins voor updates!\nVoeg een experimentele versie toe van de nieuwe pluginselectie en configuratietab - PROBEER HET UIT!\nBELANGRIJK: Configuraties in lokale / globale modus met onderliggende bruggen zullen NIET werken omdat ioBroker geen toegang heeft tot de gegevens op de onderliggende brugprocessen!",
                "fr": "mettre à jour homebridge et wrapper vers la version 1.3.4 (la dernière en date d'aujourd'hui). IMPORTANT: nécessite également l'installation de homebridge 1.3.x lors de l'utilisation du mode global et le mode local sera également mis à jour vers 1.3.x! Vérifiez vos plugins pour les mises à jour!\nAjoutez une version expérimentale du nouvel onglet de sélection et de configuration du plugin - ESSAYEZ-LE!\nIMPORTANT: les configurations en mode local / global avec des ponts enfants ne fonctionneront PAS car ioBroker ne peut pas accéder aux données sur les processus de pont enfants!",
                "it": "aggiorna homebridge e wrapper alla 1.3.4 (ultimo a partire da oggi). IMPORTANTE: richiede anche homebridge 1.3.x installato quando si utilizza la modalità globale e anche la modalità locale si aggiornerà alla 1.3.x! Controlla i tuoi plugin per gli aggiornamenti!\nAggiungi una versione sperimentale della nuova selezione di plug-in e scheda di configurazione: PROVALO!\nIMPORTANTE: le configurazioni in modalità locale / globale con bridge figlio NON funzioneranno perché ioBroker non può accedere ai dati sui processi bridge figlio!",
                "es": "actualice el homebridge y el contenedor a 1.3.4 (más reciente a partir de hoy). IMPORTANTE: Requiere también la instalación de Homebridge 1.3.x cuando se usa el modo global y el modo local también se actualizará a 1.3.x. ¡Revise sus complementos para ver si hay actualizaciones!\nAgregue una versión experimental de la nueva pestaña de selección y configuración de complementos: ¡PRUÉBELO!\nIMPORTANTE: Las configuraciones en modo local / global con puentes secundarios NO funcionarán porque ioBroker no puede acceder a los datos de los procesos del puente secundario.",
                "pl": "zaktualizuj homebridge i wrapper do wersji 1.3.4 (najnowsze na dziś). WAŻNE: Wymaga również zainstalowania homebridge 1.3.x podczas korzystania z trybu globalnego, a tryb lokalny również zostanie zaktualizowany do wersji 1.3.x! Sprawdź swoje wtyczki pod kątem aktualizacji!\nDodaj eksperymentalną wersję nowej zakładki wyboru i konfiguracji wtyczki - WYPRÓBUJ!\nWAŻNE: Konfiguracje w trybie lokalnym / globalnym z mostami podrzędnymi NIE będą działać, ponieważ ioBroker nie może uzyskać dostępu do danych w procesach mostów podrzędnych!",
                "zh-cn": "将homebridge和wrapper更新为1.3.4（截止到今天）。重要信息：在使用全局模式时，还需要安装homebridge 1.3.x，本地模式也将更新为1.3.x！检查您的插件是否有更新！\n添加新的插件选择和配置标签的实验版-尝试一下！\n重要信息：在本地/全局模式下使用子桥接器的配置将不起作用，因为ioBroker无法访问子桥接器进程上的数据！"
            },
            "3.0.2": {
                "en": "update homebridge in wrapper to 1.1.6 (latest as of today)",
                "de": "Update der Homebridge im Wrapper auf 1.1.6 (Stand heute)",
                "ru": "обновите homebridge в оболочке до версии 1.1.6 (последней на сегодня)",
                "pt": "atualize o homebridge no wrapper para 1.1.6 (o mais recente a partir de hoje)",
                "nl": "update homebridge in wrapper naar 1.1.6 (laatste vanaf vandaag)",
                "fr": "mettre à jour homebridge dans le wrapper vers la version 1.1.6 (dernière en date d'aujourd'hui)",
                "it": "aggiorna homebridge in wrapper alla 1.1.6 (ultimo a partire da oggi)",
                "es": "actualice el Homebridge en el contenedor a 1.1.6 (el último a partir de hoy)",
                "pl": "zaktualizuj homebridge w opakowaniu do wersji 1.1.6 (najnowsze na dziś)",
                "zh-cn": "将包装器中的homebridge更新为1.1.6（今天为最新）"
            },
            "3.0.1": {
                "en": "set a very high limit (again) on allowed accessories and services because irrelevant",
                "de": "Setzen Sie (erneut) eine sehr hohe Grenze für zulässiges Zubehör und Serviceleistungen, da diese irrelevant sind",
                "ru": "установить очень высокий предел (снова) на разрешенные аксессуары и услуги, потому что они неактуальны",
                "pt": "definir um limite muito alto (novamente) em acessórios e serviços permitidos porque irrelevante",
                "nl": "stel (opnieuw) een zeer hoge limiet in voor toegestane accessoires en services omdat ze niet relevant zijn",
                "fr": "fixer une limite très élevée (à nouveau) sur les accessoires et services autorisés, car non pertinents",
                "it": "impostare un limite molto alto (di nuovo) sugli accessori e servizi ammessi perché irrilevanti",
                "es": "establecer un límite muy alto (nuevamente) en los accesorios y servicios permitidos porque son irrelevantes",
                "pl": "ustawić (ponownie) bardzo wysoki limit dozwolonych akcesoriów i usług, ponieważ są one nieistotne",
                "zh-cn": "再次对允许的附件和服务设置非常高的限制，因为这无关紧要"
            },
            "3.0.0": {
                "en": "BREAKING: ONLY WORKS WITH HOMEBRIDGE 1.1.x+ AND Node JS >=10.17.0!! Make sure plugins support it AND homebridge is updated to 1.1.x when you use the Global Mode!",
                "de": "BREAKING: FUNKTIONIERT NUR MIT HOMEBRIDGE 1.1.x + UND Node JS> = 10.17.0 !! Stellen Sie sicher, dass Plugins dies unterstützen UND Homebridge auf 1.1.x aktualisiert wird, wenn Sie den globalen Modus verwenden!",
                "ru": "BREAKING: ТОЛЬКО РАБОТАЕТ С HOMEBRIDGE 1.1.x + И НОДОМ JS> = 10.17.0 !! Убедитесь, что плагины поддерживают это, и homebridge обновляется до 1.1.x при использовании глобального режима!",
                "pt": "QUEBRA: FUNCIONA SOMENTE COM O HOMEBRIDGE 1.1.x + E o nó JS> = 10.17.0 !! Certifique-se de que os plugins o suportem E o homebridge seja atualizado para 1.1.x quando você usar o Modo Global!",
                "nl": "BREAKING: WERKT ALLEEN MET HOMEBRIDGE 1.1.x + EN Node JS> = 10.17.0 !! Zorg ervoor dat plug-ins het ondersteunen EN dat homebridge wordt bijgewerkt naar 1.1.x wanneer je de Global Mode gebruikt!",
                "fr": "RUPTURE: FONCTIONNE UNIQUEMENT AVEC HOMEBRIDGE 1.1.x + ET Node JS> = 10.17.0 !! Assurez-vous que les plugins le prennent en charge ET que homebridge est mis à jour vers 1.1.x lorsque vous utilisez le mode global!",
                "it": "ROTTURA: FUNZIONA SOLO CON HOMEBRIDGE 1.1.x + E Nodo JS> = 10.17.0 !! Assicurati che i plugin lo supportino E homebridge sia aggiornato alla 1.1.x quando usi la Modalità Globale!",
                "es": "ROMPIENDO: SOLO FUNCIONA CON HOMEBRIDGE 1.1.x + Y Nodo JS> = 10.17.0 !! ¡Asegúrese de que los complementos lo admitan y que homebridge se actualice a 1.1.x cuando use el modo global!",
                "pl": "ŁAMANIE: DZIAŁA TYLKO Z HOMEBRIDGE 1.1.x + I Węzłem JS> = 10.17.0 !! Upewnij się, że wtyczki go obsługują ORAZ mostek główny jest aktualizowany do wersji 1.1.x podczas korzystania z trybu globalnego!",
                "zh-cn": "BREAKING：仅适用于HOMEBRIDGE 1.1.x +和Node JS> = 10.17.0！确保插件支持它，并且在使用全局模式时将homebridge更新为1.1.x！"
            },
            "1.1.2": {
                "en": "more then 149 accessories allowed in wrapper mode",
                "de": "Mehr als 149 Zubehörteile sind im Wrapper-Modus zulässig",
                "ru": "в режиме обертки разрешено более 149 аксессуаров",
                "pt": "mais de 149 acessórios permitidos no modo wrapper",
                "nl": "meer dan 149 accessoires toegestaan in wrapper-modus",
                "fr": "plus de 149 accessoires autorisés en mode wrapper",
                "it": "più di 149 accessori consentiti in modalità wrapper",
                "es": "más de 149 accesorios permitidos en modo envoltorio",
                "pl": "więcej niż 149 akcesoriów dozwolonych w trybie owijania",
                "zh-cn": "包装模式允许超过149个配件"
            },
            "1.1.1": {
                "en": "used homebridge to 0.4.50 updated, local mode added, plugin updates possible, install special plugin versions added, specify command line options added",
                "de": "Homebridge auf 0.4.50 aktualisiert, lokaler Modus hinzugefügt, Plugin-Updates möglich, Installation spezieller Plugin-Versionen hinzugefügt, Befehlszeilenoptionen hinzugefügt",
                "ru": "используется homebridge до версии 0.4.50, добавлен локальный режим, возможно обновление плагинов, добавлены специальные версии плагинов, указаны опции командной строки",
                "pt": "usou o homebridge para 0.4.50 atualizado, modo local adicionado, atualizações de plug-in possíveis, instalar versões de plug-ins especiais adicionadas, especificar opções de linha de comando adicionadas",
                "nl": "gebruikte homebridge naar 0.4.50 bijgewerkt, lokale modus toegevoegd, plug-in updates mogelijk, installeer speciale plug-in versies toegevoegd, specificeer commandoregel-opties toegevoegd",
                "fr": "homebridge utilisé à la version 0.4.50 mise à jour, mode local ajouté, mises à jour de plugins possibles, installation de versions de plugins spéciales ajoutées, spécification d'options de ligne de commande ajoutées",
                "it": "usato homebridge a 0.4.50 aggiornato, modalità locale aggiunta, aggiornamenti di plugin possibili, installazione di versioni di plugin speciali aggiunte, specificate le opzioni di riga di comando aggiunte",
                "es": "usó homebridge a 0.4.50 actualizado, se agregó el modo local, es posible que se actualicen los complementos, instale versiones especiales del complemento agregado, especifique las opciones de línea de comandos agregadas",
                "pl": "użyto homebridge do wersji 0.4.50, dodano tryb lokalny, możliwe aktualizacje wtyczek, zainstalowano specjalne wersje wtyczek, dodano opcje wiersza poleceń",
                "zh-cn": "使用homebridge更新0.4.50，添加本地模式，插件更新可能，安装添加的特殊插件版本，指定添加的命令行选项"
            },
            "1.0.1": {
                "en": "Add Chinese support",
                "de": "Chinesische Unterstützung hinzufügen",
                "ru": "Добавить поддержку китайцев",
                "pt": "Adicionar suporte chinês",
                "nl": "Voeg Chinese ondersteuning toe",
                "fr": "Ajouter un support chinois",
                "it": "Aggiungi supporto cinese",
                "es": "Añadir soporte chino",
                "pl": "Dodaj chińskie wsparcie",
                "zh-cn": "添加中文支持"
            },
            "0.4.5": {
                "en": "fixes and optimizations",
                "de": "Korrekturen und Optimierungen",
                "ru": "исправления и оптимизации",
                "pt": "correções e otimizações",
                "nl": "fixes en optimalisaties",
                "fr": "correctifs et optimisations",
                "it": "correzioni e ottimizzazioni",
                "es": "correcciones y optimizaciones",
                "pl": "poprawki i optymalizacje",
                "zh-cn": "修复和优化"
            },
            "0.4.4": {
                "en": "corrected automatic role determination and bugs fixed",
                "de": "korrigierte automatische Rollenermittlung und behobene Fehler",
                "ru": "исправлено автоматическое определение роли и исправлены ошибки",
                "pt": "correção automática de função corrigida e bugs corrigidos",
                "nl": "gecorrigeerde automatische rolbepaling en opgeloste bugs",
                "fr": "correction automatique du rôle et correction des bugs",
                "it": "Correzione della correzione automatica del ruolo e dei bug corretti",
                "es": "se corrigió la determinación automática del rol y se corrigieron errores",
                "pl": "naprawiono automatyczne ustalanie roli i naprawione błędy",
                "zh-cn": "更正了自动确定角色并修复了错误"
            },
            "0.4.3": {
                "en": "Updates for Homebridge-Wrapper",
                "de": "Updates für den Homebridge-Wrapper",
                "ru": "Обновления для Homebridge-Wrapper",
                "pt": "Atualizações para o Homebridge-Wrapper",
                "nl": "Updates voor Homebridge-Wrapper",
                "fr": "Mises à jour pour Homebridge-Wrapper",
                "it": "Aggiornamenti per Homebridge-Wrapper",
                "es": "Actualizaciones para Homebridge-Wrapper",
                "pl": "Aktualizacje dla Wrappera Homebridge",
                "zh-cn": "Homebridge包装器的更新"
            },
            "0.4.2": {
                "en": "fix for global mode",
                "de": "Fix für den globalen Modus",
                "ru": "исправление для глобального режима",
                "pt": "Correção para o modo global",
                "nl": "herstellen voor de mondiale modus",
                "fr": "corriger pour le mode global",
                "it": "correzione per la modalità globale",
                "es": "arreglar para el modo global",
                "pl": "naprawić w trybie globalnym",
                "zh-cn": "修复全局模式"
            },
            "0.4.1": {
                "en": "option to poll values from the plugins added and other optimisations",
                "de": "Option zum Abrufen von Werten aus den hinzugefügten Plugins und anderen Optimierungen",
                "ru": "возможность опроса значений из добавленных плагинов и других оптимизаций",
                "pt": "opção para pesquisar valores dos plugins adicionados e outras otimizações",
                "nl": "optie om waarden te peilen van de toegevoegde plug-ins en andere optimalisaties",
                "fr": "option pour interroger les valeurs des plugins ajoutés et d'autres optimisations",
                "it": "opzione per interrogare i valori dai plugin aggiunti e altre ottimizzazioni",
                "es": "opción para sondear valores de los complementos agregados y otras optimizaciones",
                "pl": "opcja odpytywania wartości z dodanych wtyczek i innych optymalizacji",
                "zh-cn": "从添加的插件和其他优化中轮询值的选项"
            },
            "0.3.0": {
                "en": "Support of ham plugins was added",
                "de": "Unterstützung von Schinken-Plugins wurde hinzugefügt",
                "ru": "Добавлена ​​поддержка плагинов ham",
                "pt": "Suporte de plugins ham foi adicionado",
                "nl": "Ondersteuning van ham-plug-ins is toegevoegd",
                "fr": "Le support des plugins jambon a été ajouté",
                "it": "È stato aggiunto il supporto per i plug-in ham",
                "es": "Soporte de plugins de jamón fue agregado",
                "pl": "Dodano obsługę wtyczek szynkowych",
                "zh-cn": "火腿插件的支持增加了"
            },
            "0.2.6": {
                "en": "Updates for Homebridge-Wrapper",
                "de": "Updates für den Homebridge-Wrapper",
                "ru": "Обновления для Homebridge-Wrapper",
                "pt": "Atualizações para o Homebridge-Wrapper",
                "nl": "Updates voor Homebridge-Wrapper",
                "fr": "Mises à jour pour Homebridge-Wrapper",
                "it": "Aggiornamenti per Homebridge-Wrapper",
                "es": "Actualizaciones para Homebridge-Wrapper",
                "pl": "Aktualizacje dla Wrappera Homebridge",
                "zh-cn": "Homebridge包装器的更新"
            },
            "0.2.5": {
                "en": "Optimize debug logging",
                "de": "Optimierung der Debug-Protokollierung",
                "ru": "Оптимизировать ведение журнала отладки",
                "pt": "Otimizar o log de depuração",
                "nl": "Optimaliseer debug-logging",
                "fr": "Optimiser la journalisation du débogage",
                "it": "Ottimizza la registrazione di debug",
                "es": "Optimizar el registro de depuración",
                "pl": "Zoptymalizuj rejestrowanie debugowania",
                "zh-cn": "优化调试日志"
            },
            "0.2.4": {
                "en": "Updates for Homebridge-Wrapper",
                "de": "Updates für den Homebridge-Wrapper",
                "ru": "Обновления для Homebridge-Wrapper",
                "pt": "Atualizações para o Homebridge-Wrapper",
                "nl": "Updates voor Homebridge-Wrapper",
                "fr": "Mises à jour pour Homebridge-Wrapper",
                "it": "Aggiornamenti per Homebridge-Wrapper",
                "es": "Actualizaciones para Homebridge-Wrapper",
                "pl": "Aktualizacje dla Wrappera Homebridge",
                "zh-cn": "Homebridge包装器的更新"
            },
            "0.2.2": {
                "en": "Fixes for JSON editor",
                "de": "Korrekturen für den JSON-Editor",
                "ru": "Исправления для редактора JSON",
                "pt": "Correções para o editor JSON",
                "nl": "Correcties voor JSON-editor",
                "fr": "Corrections pour l'éditeur JSON",
                "it": "Correzioni per l'editor JSON",
                "es": "Correcciones para el editor JSON",
                "pl": "Poprawki dla edytora JSON",
                "zh-cn": "修复JSON编辑器"
            },
            "0.2.1": {
                "en": "Public test version",
                "de": "Öffentliche Testversion",
                "ru": "Публичная тестовая версия",
                "pt": "Versão de teste público",
                "nl": "Openbare testversie",
                "fr": "Version de test publique",
                "it": "Versione di prova pubblica",
                "es": "Versión de prueba pública",
                "pl": "Publiczna wersja testowa",
                "zh-cn": "公开测试版"
            },
            "0.1.0": {
                "en": "initial adapter",
                "de": "Initiale Version",
                "ru": "Первоначальный адаптер",
                "pt": "Versão inicial",
                "fr": "Version initiale",
                "nl": "Eerste release",
                "it": "adattatore iniziale",
                "es": "adaptador inicial",
                "pl": "początkowy adapter",
                "zh-cn": "初始适配器"
            }
        },
        "title": "Homebridge accessories manager",
        "titleLang": {
            "en": "Homebridge accessories manager",
            "de": "Homebridge Zubehör Manager",
            "ru": "Менеджер по аксессуарам для домашнего моста",
            "pt": "Gerente de acessórios Homebridge",
            "nl": "Homebridge accessoires manager",
            "fr": "Gestionnaire d'accessoires Homebridge",
            "it": "Responsabile degli accessori di Homebridge",
            "es": "Gerente de accesorios de Homebridge",
            "pl": "Menedżer akcesoriów Homebridge",
            "zh-cn": "Homebridge配件经理"
        },
        "desc": {
            "en": "ioBroker Homebridge Adapter",
            "de": "ioBroker Homebridge Adapter",
            "ru": "Адаптер домашнего моста ioBroker",
            "pt": "Adaptador ioBroker Homebridge",
            "nl": "ioBroker Homebridge-adapter",
            "fr": "Adaptateur Homebridge ioBroker",
            "it": "Adattatore ioBroker Homebridge",
            "es": "Adaptador de puente doméstico ioBroker",
            "pl": "Adapter ioBroker Homebridge",
            "zh-cn": "ioBroker Homebridge适配器"
        },
        "authors": [
            "Kirov Ilya <kirovilya@gmail.com>",
            "Apollon77 <ingo@fischer-ka.de>"
        ],
        "keywords": [
            "homebridge"
        ],
        "license": "MIT",
        "platform": "Javascript/Node.js",
        "icon": "ham.png",
        "enabled": false,
        "extIcon": "https://raw.githubusercontent.com/ioBroker/ioBroker.ham/master/admin/ham.png",
        "readme": "https://github.com/ioBroker/ioBroker.ham/blob/master/README.md",
        "loglevel": "info",
        "mode": "daemon",
        "type": "iot-systems",
        "connectionType": "local",
        "dataSource": "push",
        "materialize": true,
        "materializeTab": true,
        "adminTab": {
            "singleton": true,
            "name": {
                "en": "Homebridge",
                "de": "Homebridge",
                "ru": "Homebridge",
                "pt": "Homebridge",
                "nl": "Homebridge",
                "fr": "Homebridge",
                "it": "Homebridge",
                "es": "Homebridge",
                "pl": "Homebridge",
                "zh-cn": "Homebridge"
            },
            "link": "",
            "fa-icon": "home"
        },
        "dependencies": [
            {
                "js-controller": ">=2.0.0"
            }
        ],
        "tier": 2
    },
    "native": {
        "useGlobalHomebridge": false,
        "useLocalHomebridge": false,
        "globalHomebridgeBasePath": "/usr/local/lib/node_modules/homebridge/",
        "globalHomebridgeConfigPath": "/home/pi/.homebridge/",
        "libraries": "",
        "ignoreInfoAccessoryServices": false,
        "insecureAccess": false,
        "characteristicPollingInterval": 0,
        "wrapperConfig": {
            "description": "Add configuration for your accessories or platforms according to the docs of the plugins.",
            "accessories": [],
            "platforms": []
        },
        "updateLibraries": false,
        "virtualCommandLine": ""
    },
    "objects": [],
    "instanceObjects": []
}